**Reshaping data**: untuk mengubah data yang ‘tidy’ menjadi data yang lebih relevan dan lebih optimal untuk di jadikan bahan analisis.

Ada beberapa teknik reshaping data di pandas, beberapa diantaranya adalah **_Pivoting_** dan **_Melting_**.

## Pivoting Data

Pivoting adalah suatu pengubahan bentuk data dengan memutar data yang terletak di baris menjadi di column dapat dikatakan juga pivoting tabel adalah melakukan perubahan pada bentuk data dari yang tadinya panjang menjadi lebar.

Ada beberapa metode untuk melakukan pivoting di pandas, yaitu **_pivot()_** dan **_pivot_table()_**

In [1]:
import pandas as pd

In [14]:
data = {
    'foo': ['one']*3 + ['two']*3,
    'bar': ['A', 'B', 'C', 'A', 'B', 'C'],
    'baz': [1, 2, 3, 4, 5, 6],
    'zoo': ['x', 'y', 'z', 'q', 'w', 't']
}

df = pd.DataFrame(data)
df

   foo bar  baz zoo
0  one   A    1   x
1  one   B    2   y
2  one   C    3   z
3  two   A    4   q
4  two   B    5   w
5  two   C    6   t

ada beberapa argument paling penting di dalam method pivot_tabel yang perlu kita perhatikan, diantaranya :

- values : Argumen ini mendefiniskan **column** mana dari dataframe yang asli yang akan di jadikan **values** yang ingin kita lihat di dalam hasil pivoting tabel kita.
- columns : Data dari **column** mana yang akan dijadikan **column baru** di dalam hasil pivoting dataframe kita.
- index : Data dari **column** mana yang akan dijadikan **index** di dalam hasil pivoting dataframe kita.

In [19]:
# contoh pivot_table
pivot_result = df.pivot_table(values='baz', index='foo', columns='bar')

In [20]:
pivot_result

bar  A  B  C
foo
one  1  2  3
two  4  5  6

## Melting Data

Melting adalah **‘unpivoting’**, melting mengubah suatu data dengan memutar dari yang tadinya berada di posisi **_column_** menjadi di posisi **_row_**.

Melting mengubah data yang tadinya lebar menjadi panjang.

In [25]:
# contoh melting

## Membuat dataframe sederhana

## importing library pandas
import pandas as pd

In [33]:
## Membuat dataframe
df = pd.DataFrame({
    'Name': {0: 'John', 1: 'Bob', 2: 'Shiela'},
    'Course': {0: 'Masters', 1: 'Graduate', 2: 'Graduate'},
    'Age': {0: 27, 1: 23, 2: 21}
})

df

     Name    Course  Age
0    John   Masters   27
1     Bob  Graduate   23
2  Shiela  Graduate   21

Dalam menggunakan method melt, ada beberapa argument yang penting untuk di perhatikan, diantaranya adalah :

- id_vars : columns mana yang akan dijadikan identifier variabel
- value_vars : columns yang akan menjadi value setelah kita melakukan ‘unpivot’ terhadap variabel, jika tidak di definisikan maka semua column selain id_vars akan dijadikan value_vars.

In [38]:
# unpivot table
pd.melt(df, id_vars=['Name'], value_vars=['Course', 'Age'])

     Name variable     value
0    John   Course   Masters
1     Bob   Course  Graduate
2  Shiela   Course  Graduate
3    John      Age        27
4     Bob      Age        23
5  Shiela      Age        21

In [41]:
pd.melt(df, id_vars='Name', value_vars='Course')

     Name variable     value
0    John   Course   Masters
1     Bob   Course  Graduate
2  Shiela   Course  Graduate

In [42]:
# value_vars tidak di-set, maka otomatis column selain dari id_vars akan menjadi value_vars
pd.melt(df, id_vars='Name')

     Name variable     value
0    John   Course   Masters
1     Bob   Course  Graduate
2  Shiela   Course  Graduate
3    John      Age        27
4     Bob      Age        23
5  Shiela      Age        21

In [35]:
pd.melt?